<template>
<!-- greenland -->
    <div class="registeragreement">
        <el-dialog :title="title?title:'协议'" :visible.sync="RegisterAgreementVisible" width="1100px" >
            <div class="argeementContent" v-if="title === 'CFCA数字证书服务协议'">
                <!-- <p style="text-align:center; font-size:14px; font-weight:bold">
                    CFCA数字证书服务协议
                </p> -->
                <p>
                    尊敬的用户：
                </p>
                <p>
                    中金金融认证中心有限公司(即中国金融认证中心，简称CFCA)是经国家有关管理机关审批设立的电子认证服务机构，作为金融行业权威的第三方安全认证机构，通过数字证书注册机构（以下简称RA）向用户（以下简称订户）发放数字证书，为订户网上交易提供信息安全保障。
                </p>
                <p>
                    订户在申请使用CFCA签发的数字证书之前，应先阅读并同意"CFCA数字证书服务协议"(以下称"本协议")。本协议构成订户与中金金融认证中心有限公司之间的权利义务约定，若不同意本协议全部或部分条款，请勿申请使用CFCA数字证书。订户一旦使用CFCA数字证书，即表明同意接受并愿意遵守本协议的所有条款。
                </p>
                <p>
                    <span>
                        <b>
                            一、 证书订户的权利和义务
                        </b>
                    </span>
                </p>
                <p>
                    1、 订户应遵循诚实、信用原则，在向RA申请数字证书时，应当提供真实、完整和准确的信息和资料，并在这些信息、资料发生改变时及时通知原RA。如因订户故意或过失提供的资料不真实或资料改变后未及时通知CFCA或原RA，造成的损失由订户自己承担。
                </p>
                <p>
                    2、 在通过RA的审核、信息注册后，订户即可获得数字证书。订户也可以委托或授权他人通过其他安全的方式获得数字证书。首次使用，视为确认生效。
                </p>
                <p>
                    3、 订户须使用经合法途径获得的相关软件。
                </p>
                <p>
                    4、 订户应合法使用CFCA发放的数字证书，并对使用数字证书的行为负责。
                </p>
                <p>
                    5、 订户应当妥善保管与数字证书关联的私钥和密码，不得泄漏或交付他人。如因故意或过失导致他人盗用、冒用数字证书私钥和密码时，订户应承担由此产生的责任。
                </p>
                <p>
                    6、 如订户使用的数字证书私钥和密码泄漏、丢失，或者订户不希望继续使用数字证书，或者订户主体不存在，订户或法定权利人应当立即到原RA申请废止该数字证书，废止证书的相关手续遵循RA的规定。CFCA收到RA的废止请求后，应在及时废止该订户的数字证书。
                </p>
                <p>
                    7、 如订户怀疑数字证书的私钥或者密码泄露、丢失，或者CFCA怀疑订户提交的信息不适当或者怀疑订户未正确使用数字证书，订户应积极配合CFCA的相关调查，并停止使用该证书。
                </p>
                <p>
                    8、 由于以下情况，订户损害CFCA利益的，订户须向CFCA赔偿全部损失。这些情况是：
                </p>
                <p>
                    1) 订户在申请数字证书时没有提供真实、完整、准确信息，或在这些信息变更时未及时通知RA；
                </p>
                <p>
                    2) 订户知道自己的私钥已经失密或者可能已经失密未及时告知有关各方、并终止使用；
                </p>
                <p>
                    3) 订户有其他过错或未履行本协议的相关约定。
                </p>
                <p>
                    9、 订户有按期缴纳数字证书服务费的义务，费用标准请咨询RA。
                </p>
                <p>
                    10、 随着技术的进步，CFCA有权要求订户更换数字证书。订户在收到数字证书更换通知后，应在规定的期限内到原RA更换。
                </p>
                <p>
                    <span>
                        <b>
                            二、 CFCA的服务、权利、义务、责任限制和免责
                        </b>
                    </span>
                </p>
                <p>
                    1、 CFCA依法制定CPS，并公布于CFCA网站（www.cfca.com.cn），明确CFCA数字证书的功能、使用证书各方的权利、义务以及CFCA的责任范围，本协议的相关条款源自CPS。
                </p>
                <p>
                    2、 CFCA为订户提供7X24小时热线支持服务（4008809888）。为保证我们的服务质量，CFCA设立了投诉电话（010-83519756），CFCA将在1个工作日内对订户的意见和建议做出响应。
                </p>
                <p>
                    3、 在订户通过安全工具使用数字证书对交易信息进行加密和签名的条件下，保证交易信息的保密性、完整性、抗抵赖性。如果发生纠纷，CFCA将依据不同情承担下述义务：
                </p>
                <p>
                    1） 提供签发订户数字证书的CA证书。
                </p>
                <p>
                    2） 提供订户数字证书在交易发生时，在或不在CFCA发布的数字证书废止列表内的证明。
                </p>
                <p>
                    3） 对数字证书、数字签名、时间戳的真实性、有效性进行技术确认。
                </p>
                <p>
                    4、 对于下列情况之一，CFCA有权撤销所签发的数字证书：
                </p>
                <p>
                    1) 订户申请数字证书时，提供的资料不真实；
                </p>
                <p>
                    2) 订户未履行本协议约定的义务；
                </p>
                <p>
                    3) 订户书面申请撤销数字证书；
                </p>
                <p>
                    4) 证书的安全性不能得到保证；
                </p>
                <p>
                    5) 法律、行政法规规定的其他情况。
                </p>
                <p>
                    5、 CFCA将利用订户申请数字证书时提交的个人信息进行身份审核，提供证书生命周期内的相关服务，同时向相关方提供查询服务。CFCA及其注册机构均有义务保护订户隐私信息安全性。
                </p>
                <p>
                    6、 根据《电子签名法》的规定，订户依据CFCA提供的认证服务进行民事活动遭受损失，CFCA将给予赔偿，除非CFCA能够证明其提供的服务是按照《电子签名法》等相关法律法规和CFCA向主管部门备案的CPS实施的。以下损失不在赔偿之列：
                </p>
                <p>
                    1) 任何直接或间接的利润或收入损失、信誉或商誉损害、任何商机或契机损失、失去项目、或失去或无法使用任何数据、设备或软件；
                </p>
                <p>
                    2) 由上述损失相应生成或附带引起的损失或损害；
                </p>
                <p>
                    7、 以下损失CFCA将不承担责任：
                </p>
                <p>
                    1）非由于CFCA的行为而导致的损失；
                </p>
                <p>
                    2）由于不可控制的事项而导致的损失，如罢工、战争、灾害、恶意代码病毒等。
                </p>
                <p>
                    8、 订户在发现或怀疑由CFCA提供的认证服务造成订户的网上交易信息的泄漏和/或篡改时，应在3个月内向CFCA提出争议处理请求并通知有关各方。
                </p>
                <p>
                    <span>
                        <b>
                            三、 其他
                        </b>
                    </span>
                </p>
                <p>
                    1. 本协议中涉及“原RA”的条款若因原RA合并或撤销，即原RA不存在，则业务的受理与开展应到另行指定的RA进行。
                </p>
                <p>
                    2. 建议订户经常浏览CFCA网站，以便及时了解CFCA有关证书管理、《CFCA电子认证业务规则》和本协议变更公示等方面的信息。
                </p>
                <p>
                    3. CFCA有权对本协议进行修订，修订后的本协议将公布于CFCA网站（www.cfca.com.cn）。如订户在公布修订的1个月后继续使用CFCA提供的数字证书服务，即表明同意接受此等修订的约束。如果订户不予接受本协议中的约束，订户可以在上述期限内单方以书面形式向RA申请停止使用证书。
                </p>
                <p>
                    4. 因依据CFCA的电子认证服务而发生的争议，双方先协商解决（必要时CFCA将召集业内专家组成专家小组，详细流程参见CPS的相关条款），双方不能达成一致意见的，将提交北京仲裁委员会申请仲裁。
                </p>
            </div>
             <div class="argeementContent" v-else>
                <!-- <p style="text-align:center; font-size:14px; font-weight:bold">
                    会员服务协议
                </p> -->
                <p style="text-align:center">
                    (2017年 V2.1版)
                </p>
                <p>
                    <span>
                        <b>
                            【重要提示】
                        </b>
                    </span>
                    本协议由会员与系统网站（网址：www.Easy-Sight.com，以下简称“系统”）运营方深圳市榕时代科技有限公司订立，在会员与系统之间具有合同上的法律效力。在会员申请注册成为系统会员前，请会员审慎阅读并选择接受或不接受本协议。当会员或会员委托的个人选择“我已阅读、理解并同意《会员服务协议》”并点击“实名认证”按钮，按照系统规定的注册程序成功注册为会员，您的行为即表示同意并签署了本协议,本协议内容包括协议正文及系统已经发布或将来可能发布的各类规则，所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。若会员不同意本协议，或对本协议的条款存在任何疑问，会员可停止进行系统会员注册程序。系统有权根据业务需要酌情修订“条款”，并以网站公告的形式进行更新，不再单独通知予会员。经修订的“条款”一经在系统公布，即产生效力。如会员不同意相关修订，请会员立即停止使用“服务”。如会员继续使用“服务”，则将视为会员已接受经修订的“条款”，当会员与系统发生争议时，应以最新的“条款”为准。
                </p>
                <p>
                    <span>
                        <b>
                            第一条 释义
                        </b>
                    </span>
                </p>
                <p>
                    1.1除本协议另有约定外，本协议中下列有关用语具有如下含义：
                </p>
                <p>
                    (1)系统：指由深圳市榕时代科技有限公司投资并运营，提供融资居间等相关服务的专业性网站，即系统网站（网址：www.Easy-Sight.com）。
                </p>
                <p>
                    (2)现金管理结算账户：指会员在系统进行用户注册后，企业会员通过系统在合作银行开设的账户。会员可以使用该账户开展活期存款、结算、查询等业务。
                </p>
                <p>
                    (3)会员：指接受并同意本协议及系统的业务规则，通过系统进行交易的系统企业注册会员。
                </p>
                <p>
                    (5)交易：会员通过系统与其他会员达成交易意向并进行交易的活动。
                </p>
                <p>
                    <span>
                        <b>
                            第二条服务简介
                        </b>
                    </span>
                </p>
                <p>
                    2.1系统首页域名为 www.Easy-Sight.com（日后变更首页域名的，以变更后的为准）；通过系统（含移动客户端及其他登录客户端）为会员提供网络交易等服务。
                </p>
                <p>
                    实现商品采购流通过程中的信息覆盖全流程记录追踪，实时监控商品从生产、加工、销售、使用环节的数据流向。为商品生产和流通企业的经营活动提供血液，提高商品生产和流通企业的资金周转率，降低生产流通成本，扩大生产规模，提高流通效率。
                </p>
                <p>
                    具体服务内容包括但不限于：贸易合同签署、订单、收发货、结算、融资需求、融资交易撮合、融资合同、融资还款、收付款等； 贯穿交易全过程，保证记录真实不可篡改，帮助用户脱离第三方担保，建立自信任机制。企业可自主选择对第三方公开信息，通过系统可视交易保障信息透明，解决资金方和企业信息不对称的难题。为改善会员体验或经营需要，会员服务的项目和内容可能会不时调整。
                </p>
                <p>
                    企业可直接向资金方进行融资；资金方从平台筛选已刻画好的企业贸易背景，竞价投放。融资放款直达现金管理结算账户；融资（或贸易）回款直接归还资金方。通过系统这个信用机器，保证应收账款的真实性，监控资金流向。建立一个健康稳固的供应链系统。
                </p>
                <p>
                    2.2本系统基于“区块链”为核心技术开发而来；为系统实施过程保驾护航。
                </p>
                <p>
                    “区块链”是防篡改、共享数字账本，用于记录共有或私有对等网络中的交易。账本分发给网络中的所有成员节点，在区块中永久记录网络中对等节点之间发生的资产交易记录。所有经过确认和证明的交易都从链的开头一直链接到最新的区块，因此得名“区块链”。其可以充当单一事实来源，而且“区块链”网络中的成员能查看他们相关的交易。旨在为资金需求方会员和投资方会员提供融资需求对接服务，帮助有资金需求的会员获得更低成本的资金，同时，提高闲置资金的投资收益。
                </p>
                <p>
                    2.3系统向会员提供以下服务中的一项或多项：
                </p>
                <p>
                    (1)撮合会员之间进行融资的居间服务；
                </p>
                <p>
                    (2)既有债权的转让；
                </p>
                <p>
                    (3)信用咨询及融资管理服务；
                </p>
                <p>
                    (4)其他相关服务。
                </p>
                <p>
                    系统向会员提供服务的具体内容由相关方之间另行签署的协议约定。
                </p>
                <p>
                    2.4会员在系统注册成功后，会员通过系统在合作银行开立的现金管理结算账户，该账户将成为会员的专属账户，会员对现金管理结算账户享有排他所有权。系统对会员账户严格保密。在系统进行的所有资金的往来、结算均实际通过银行进行，系统将通过该现金管理结算账户为会员办理活期存款、结算、查询等业务。会员须在系统进行资金管理、使用等操作，并在此不可撤销地授权系统按照本协议及业务规则向合作银行发出关于管理现金管理结算账户内资金的指令。系统及合作银行将保证会员的资金安全。该现金管理结算账户将在会员在系统注册的账户注销后自动关闭，关闭时现金管理结算账户余额对应的资金将由会员自行进行清算、结转。
                </p>
                <p>
                    2.6系统向会员提供电子合同的备份、查看、核对、下载等服务，如对电子合同真伪或电子合同的内容有任何疑问，会员可通过使用系统的查询功能进行核对。除有相反证据证明外，系统所记录并在系统网页上显示的数据和信息是确定交易具体内容的依据。
                </p>
                <p>
                    2.7为更好地为会员提供会员服务，系统可能会委托相关合作方为会员提供一部分会员服务而无须经过会员的同意或特别告知会员；对此，会员完全理解并予以同意。
                </p>
                <p>
                    2.8 系统为会员提供CFCA认证服务，即系统通过委托CFCA中国金融认证中心为会员提供网络身份认证、数字证书及电子印章服务，以保障系统会员身份的真实性，及行为的有效性。
                </p>
                <p>
                    2.9会员应自行准备上网设备，包括但不限于计算机、调制解调器或其他必备的上网装置，并自行承担上网开支，包括但不限于网络接入费、手机流量费等费用。
                </p>
                 
                <p>
                    <span>
                        <b>
                            第三条 会员管理
                        </b>
                    </span>
                </p>
                <p>
                    3.1会员资格
                </p>
                <p>
                    3.1.1会员完成注册或以其他系统允许的方式实际使用服务时，会员应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若会员不具备前述主体资格，请勿使用服务，否则会员及会员的监护人应承担因此而导致的一切后果，且系统有权注销（永久冻结）会员的账户，并向会员及会员的监护人索偿。如会员代表一家公司或其他法律主体在系统登记，则会员声明和保证，会员有权使该公司或该法律主体受本协议“条款”的约束。
                </p>
                <p>
                    3.2会员注册 
                </p>
                <p>
                    3.2.1在会员按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在会员按照页面提示填写信息、阅读并同意本协议且完成全部准入程序后，或会员以其他系统允许的方式实际使用系统服务时，会员即受本协议的约束。会员可以使用会员提供或确认的邮箱、手机号码或者系统允许的其它方式作为登录手段进入系统。 
                </p>
                <p>
                    3.2.2会员了解并同意，如会员系在本网站完成的注册程序，只要会员注册成功，会员即可以获得会员的系统登录名。
                </p>
                <p>
                    3.2.3会员申请成为系统会员时，应自行向系统提供真实、准确、完整、合法有效的注册资料；当会员的注册资料发生变动时，应及时进行更新。如果涉及会员名称、营业执照注册号、组织机构代码证编号、税务登记证编号、开户许可证编号、法定代表人姓名及其身份证号码等信息变动的，须经系统审核后生效。会员应保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性。一旦系统向会员注册资料中提供的地址发送通知即视为已向该会员送达。如有合理理由怀疑会员提供的资料错误、不实、过时或不完整的，系统有权向会员发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对会员提供部分或全部系统服务，系统对此不承担任何责任，会员将承担因此产生的任何直接或间接损失及不利后果。
                </p>
                <p>
                    3.2.4成功注册成为系统会员后，会员可以使用会员提供或确认的邮箱、手机号码或者系统允许的其它方式作为登录手段进入系统。会员即获得其独享的专用账户（以下简称“会员账户”），会员账户是会员登陆系统的唯一账户。登录系统时会员应当使用会员账户和会员设定并保管的密码或者系统允许的方式进行登录；会员应妥善保管会员的会员账户密码，因密码保管不善而造成的经济损失由会员自行承担；为保护会员的权益，会员在设定会员账户密码时，请使用符合系统要求的密码策略。
                </p>
                <p>
                    3.2.5会员注册成功后，除非有法律规定或司法裁定，且征得系统的同意，否则，会员的系统登录名、账户名称和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。会员须自行负责对会员的系统登录名、账户名称和密码保密，且须对该登录名、账户名称和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。会员同意：(a)如发现任何人未经授权使用会员的系统登录名、账户名称和密码，或发生违反保密规定的任何其他情况，会员会立即通知系统，并授权系统将该信息同步给系统站；(b)确保会员在每个上网时段结束时，以正确步骤离开网站。系统不能也不会对因会员未能遵守本款规定而发生的任何损失或损毁负责。会员理解系统对会员的请求采取行动需要合理时间，系统对在采取行动前已经产生的后果（包括但不限于会员的任何损失）不承担任何责任。系统对会员的用户名和密码的遗失或被盗所产生的后果不承担任何责任。
                </p>
                <p>
                    3.2.6会员同意并认可系统可以通过邮件、短信、电话、系统消息等形式，向会员发送告知信息。
                </p>
                <p>
                    <span>
                        <b>
                            第四条 系统的基本使用规则
                        </b>
                    </span>
                </p>
                <p>
                    4.1关于会员资料的规则
                </p>
                <p>
                    4.1.1“会员资料”包括会员在注册、发布信息或交易等过程中、在任何公开信息场合或通过任何电子邮件形式，向系统或其他用户提供的任何资料 ，包括数据、文本、软件、音乐、声响、照片、图画、影像、词句或其他材料。会员应对“会员资料”负全部责任，而系统仅作为会员在网上发布和刊登“会员资料”的被动渠道。 
                </p>
                <p>
                    4.1.2会员同意并承诺，“会员资料”和会员供在系统网站上交易的任何“物品”（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的物品，或某种权利或利益，或某种票据或证券，或某种服务或行为。本协议中“物品”一词均含此义）:
                </p>
                <p>
                    a.不会有欺诈成份，与售卖伪造或盗窃无涉； 
                </p>
                <p>
                    b.不会侵犯任何第三者对该物品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权；
                </p>
                <p>
                    c.不会违反任何法律、法规、条例或规章(包括但不限于关于规范出口管理、凭许可证经营、贸易配额、保护消费者、不正当竞争或虚假广告的法律、法 规、条例或规章)、本协议及相关规则； 
                </p>
                <p>
                    d.不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容； 
                </p>
                <p>
                    e.不会含有淫秽、或包含任何儿童色情内容； 
                </p>
                <p>
                    f.不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或 其他电脑程序； 
                </p>
                <p>
                    g.不会直接或间接与下述各项货物或服务连接，或包含对下述各项货物或服务的描述：(i)本协议项下禁止的货物或服务；或(ii)会员无权连接或包含的货物或服务。此外，会员同意不会：（ⅲ）在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用“服务”；(ⅳ)未经其他人士同意，利用“服务”收集其他人士的电子邮件地址及其他资料；或（ⅴ）利用“服务”制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或信息的来源方面误导其他人士； 
                </p>
                <p>
                    h.不含有系统认为应禁止或不适合通过系统网站宣传或交易。
                </p>
                <p>
                    4.1.3会员同意，会员不会对任何资料作商业性利用，包括但不限于在未经系统事先书面批准的情况下，复制在系统网站上展示的任何资料并用于商业用途。
                </p>
                <p>
                    4.2关于交易的规则 
                </p>
                <p>
                    4.2.1一旦会员注册成为系统用户，并使用系统提供的任何一项交易服务，即表示会员已同意本协议及相关业务规则，并表示会员已同意由系统发送系统消息的方式进行通知。
                </p>
                <p>
                    4.2.2会员通过在系统上输入其注册的用户名以及设定的密码，并依照系统相关业务规则所规定的流程，以中国金融认证中心颁发的与系统绑定的数字证书在系统上通过点击确认或类似方式签署数据电文，会员通过前述方式订立的电子合同对合同各方具有法律约束力。会员一旦向系统发出指令，便不得撤回或撤销，且成为系统向会员提供有关交易服务的唯一指令。
                </p>
                <p>
                    4.2.3系统与银行等金融机构合作为会员提供相关服务，但是，系统本身并不是银行等金融机构，系统向会员提供的交易服务也非金融业务，本协议项下的资金结算均通过银行来实现，会员理解并同意其资金在银行体系间流转需要合理时间。
                </p>
                <p>
                    4.2.5在会员注册成为系统用户时，会员授权系统可通过银行或向第三方机构收集会员相关资料，以核实会员身份、资产、信用等方面的真实状况。如遇特殊情况或政府机关、第三方机构需要提供纸质资料，系统有权向会员收集相关纸质资料，会员无条件给予配合和按照要求提供。
                </p>
                <p>
                    4.2.6会员提供的在系统上展示的文字描述、图画和/或照片，可以是(a)对会员拥有而会员希望出售的产品的描述；或(b)对会员正寻找的产品的描述。会员须将该等产品描述归入正确的类目内。系统不对产品描述的准确性或内容负责。 
                </p>
                <p>
                    4.2.7会员同意不利用帮助实现蒙蔽或欺骗意图的同伙(下属的客户或第三方)，操纵与另一交易方所进行的商业谈判的结果。 
                </p>
                <p>
                    4.2.8 会员同意，会员不得使用任何装置、软件或例行程序干预或试图干预系统的正常运作或正在系统网站上进行的任何交易。会员不得采取对任何将不合理或不合比例的庞大负载加诸系统网络结构的行动。 
                </p>
                <p>
                    4.2.9会员不得采取任何可能损害信息反馈系统的完整性的行动，诸如：利用第二会员身份标识或第三者为会员本身留下正面反馈；利用第二会员身份标识或第三者为其他用户留下负面反馈(反馈数据轰炸)；或在用户未能履行交易范围以外的某些行动时，留下负面的反馈(反馈恶意强加)。
                </p>
                <p>
                    4.2.10系统所涉及到的任何款项只以人民币计结，系统不提供任何形式的汇兑业务。
                </p>
                <p>
                    4.2.11会员在使用系统进行交易的过程中，本协议及相关业务规则共同构成系统的使用规则。若会员使用本协议或业务规则中所涉及的交易服务项目，即表示会员同意并接受各项规则所规定的相关内容。同时，会员同意系统有权单方修改本协议或各项业务规则，而无须另行征得会员的同意，否则，会员应立即停止使用系统提供的相关交易服务和系统的有关功能。若会员继续使用系统提供的相关服务或系统相关功能，则视为会员同意并接受有关业务规则修改后的内容。
                </p>
                <p>
                    4.3关于处理交易争议。 
                </p>
                <p>
                    4.3.1系统不涉及用户间因交易而产生的法律关系及法律纠纷，不会且不能牵涉进交易各方的交易当中。倘若会员与一名或一名以上用户，或与会员通过系统获取其服务的第三者服务供应商发生争议，会员免除系统(及系统代理人和雇员)在因该等争议而引起的，或在任何方面与该等争议有关的不同种类和性质的任何(实际和后果性的)权利主张、要求和损害赔偿等方面的责任。 
                </p>
                <p>
                    4.3.2系统有权受理并调处会员与其他用户因交易产生的争议，同时有权单方面独立判断其他用户对会员的投诉及(或)索偿是否成立，若系统判断索偿成立，则会员应及时使用自有资金进行偿付，否则系统有权使用会员交纳的保证金（如有）或扣减已购系统及其关联公司的产品或服务中未履行部分的费用的相应金额或会员在系统所有账户下的其他资金(或权益)等进行相应偿付。系统没有使用自用资金进行偿付的义务，但若进行了该等支付，会员应及时赔偿系统的全部损失，否则系统有权通过前述方式抵减相应资金或权益，如仍无法弥补系统损失，则系统保留继续追偿的权利。因系统是非司法机构，会员完全理解并承认，系统对证据的鉴别能力及对纠纷的处理能力有限，受理贸易争议完全是基于会员之委托，不保证争议处理结果符合会员的期望，亦不对争议处理结果承担任何责任。系统有权决定是否接受会员委托参与争议的调处。 
                </p>
                <p>
                    4.3.3系统有权通过电子邮件等联系方式向会员了解情况，并将所了解的情况通过电子邮件等方式通知对方，会员有义务配合系统的工作，否则系统有权做出对会员不利的处理结果。
                </p>
                <p>
                    4.3.4 如系统发生了因系统故障或其他任何原因导致的处理错误，系统都有权纠正该错误。如该错误导致会员实际收到的款项多于应获得的金额，则无论错误的性质和原因为何，系统保留纠正不当执行的交易的权利，会员应根据系统向会员发出的有关纠正错误的通知的具体要求返还多收的款项或进行其他操作。会员理解并同意，会员因前述处理错误而多付或少付的款项均不计利息。
                </p>
                <p>
                    4.4违反规则的后果
                </p>
                <p>
                    4.4.1倘若系统认为“会员资料”可能使系统承担任何法律或道义上的责任，或可能使系统(全部或部分地)失去系统的互联网服务供应商或其他供应商的服务，则系统可自行全权决定对“会员资料”采取系统认为必要或适当的任何行动，包括但不限于删除该类资料。会员特此保证，会员对提交给系统的“会员资料”拥有全部权利，包括全部版权。会员确认，系统没有责任去认定或决定会员提交给系统的资料哪些是应当受到保护的，对享有“服务”的其他用户使用“会员资料”，系统也不必负责。 
                </p>
                <p>
                    4.4.2对于会员涉嫌违反承诺的行为对任意第三方造成损害的，会员均应当以自己的名义独立承担所有的法律责任，并应确保系统免责。 
                </p>
                <p>
                    4.4.3经生效法律文书确认用户存在违法或违反本协议行为或者系统自行判断用户涉嫌存在违法或违反本协议行为的，系统有权在系统上以网络发布形式公布用户的违法行为并做出处罚（包括但不限于限权、终止服务等）。 
                </p>
                <p>
                    4.4.4若会员未遵从本协议或相关业务规则，则系统有权拒绝为会员提供相关服务，会员对由此产生的损害自行承担责任。若发生上述状况，而相关款项已先行划付至会员的现金管理结算账户名下，会员同意由系统向合作银行发出指令直接扣回相关款项或限制会员提取和使用此笔款项。若此笔款项已汇入会员指定的银行账户，则系统有向会员事后索回之权利；因会员的原因导致系统事后追索的，会员应当承担全部的追索费用。
                </p>
                <p>
                    <span>
                        <b>
                            第五条 服务费用
                        </b>
                    </span>
                </p>
                <p>
                    5.1在会员接受系统提供的服务时，系统有权向会员收取相关服务费用，系统拥有制定及调整服务费用的权利。
                </p>
                <p>
                    5.1.1融资及基础交易促成的服务费
                </p>
                <p>
                    5.1.2会员通过系统或系统提供服务促成融资，实际从资金方获得资金的，会员应向系统支付服务费，具体收费标准以会员使用系统提供的交易服务时，系统上所列收费方式公告或与最终达成的其他书面协议为准。
                </p>
                <p>
                    5.1.3会员在使用系统服务过程中可能需要向第三方（保理公司或银行等）支付一定的费用，具体收费标准以会员使用系统提供的交易服务时，系统上所列收费方式公告或会员与第三方达成的其他书面协议为准。
                </p>
                <p>
                    5.1.4除另有说明或约定，会员同意系统从其授权系统管理的现金管理结算账户中直接扣收已到期的融资本金、利息、逾期利息，及第三方收费，实际扣收金额以相关的业务单据为准。
                </p>
                <p>
                    5.1.5会员在系统内的任何一笔融资或交易均有权授权提供融资的资金方代为支付服务费，会员需确保资金方知悉并同意系统从融资金额（包括应收账款转让对价）或交易金额中扣除上述服务费，因会员未授权和未告知资金方，对资金方造成的一切损失由会员自行承担。
                </p>
                <p>
                    5.1.6上述服务费会员应在收到系统发出的付款通知后1个工作日内通过银行汇款汇入以下深圳市榕时代科技有限公司指定的账户：
                </p>
                <p>
                    开户银行：深圳市榕时代科技有限公司
                </p>
                <p>
                    户 名：上海浦东发展银行 深圳科技园支行
                </p>
                <p>
                    银行账号：7921 0154 7400 0456 4
                </p>
                <p>
                    5.1.7系统涉及单笔融资和交易提前中止或终止的、或会员因自身原因未接受系统提供的任一一项服务的，系统已收取的服务费不予退还。
                </p>
                <p>
                    <span>
                        <b>
                            第六条 系统的服务限制与服务终止
                        </b>
                    </span>
                </p>
                <p>
                    6.1系统可随时根据战略规划或市场行情中断一项或多项服务，除法律另有规定外，系统无义务对任何个人或第三方负责。若会员反对任何本协议条款或对本协议条款修改有疑问，或对系统的服务不满，会员可以不再使用系统提供的会员服务。
                </p>
                <p>
                    6.2系统有权基于单方判断（包含但不限于系统认为会员已经违反本协议的明文规定及精神），暂停或终止向会员提供交易服务，并移除会员资料或交易数据。
                </p>
                <p>
                    6.3在系统发现会员实施的交易异常，或系统对会员实施的交易有疑问，或系统认为会员实施的行为有违反法律法规规定、本协议及相关业务规则时，系统可对会员采取特殊限制措施（包括但不限于对会员名下未完成的交易采取取消交易、调账、暂停交易服务等），并通过网站公告或系统消息的形式通知会员。
                </p>
                <p>
                    <span>
                        <b>
                            第七条 用户注销
                        </b>
                    </span>
                </p>
                <p>
                    7.1如会员需要注销其在系统注册的用户名，应首先清偿所有应付款项（包括但不限于借款本金、利息、罚息、违约金、服务费、管理费等），再将会员账户中的可用款项（如有）全部取现或者向系统发出其他合法的支付指令，并向系统申请冻结该会员账户，经系统审核同意后可正式注销会员账户，会员的账户被注销后，系统没有义务为会员保留或向会员披露会员账户中的任何信息，也没有义务向会员或第三方转发任何会员未曾阅读或发送过的信息。
                </p>
                <p>
                    7.2系统注销该注册用户名，即表明系统与会员之间的服务协议已解除，但会员仍应对使用系统提供的交易服务期间的行为承担可能的违约或损害赔偿责任，同时系统仍可保有会员的相关资料和交易数据。
                </p>
                <p>
                    7.4会员同意并授权系统站，如会员在任意系统站有欺诈、发布或销售伪劣商品、侵权他人合法权益或其他严重违反任意系统站规则的行为，该网站在系统站的范围内对此有权披露，会员的系统登录名可能被注销。
                </p>
                <p>
                    <span>
                        <b>
                            第八条 责任范围及责任限制
                        </b>
                    </span>
                </p>
                <p>
                    8.1系统仅对本协议中列明的责任范围承担责任。系统及系统的董事、员工、代理人均不以任何明示或默示的方式对会员通过系统形成的融资交易及其履行提供任何担保。会员应基于自己的判断决定是否与其他会员进行交易，并自行承担相应的后果。系统在此提示，系统已经充分地向会员陈述此类责任承担问题，会员注册并使用网站的行为表明该会员已明了并接受系统关于此类责任的划分。
                </p>
                <p>
                    8.2会员明确理解和同意，系统不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿(无论系统是否已被告知该等损害赔偿的可能性)：(i)使用或未能使用“服务”；(ii)因通过或从“服务”购买或获取任何货物、样品、数据、资料或服务，或通过或从“服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；(iii)未经批准接入或更改会员的传输资料或数据；(iv)任何第三者对“服务”的声明或关于“服务”的行为；或(v)因任何原因而引起的与“服务”有关的任何其他事宜，包括疏忽。 
                </p>
                <p>
                    8.4系统会尽一切努力使会员在使用网站的过程中得到乐趣。遗憾的是，系统不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，会员明确理解和同意，会员使用“服务”的风险由会员自行承担，且“服务”以“按现状”和“按可得到”的状态提供。系统明确声明不作任何种类的明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。系统对下述内容不作保证：(i)“服务”会符合会员的要求；(ii)“服务”不会中断，且适时、安全和不带任何错误；(iii)通过使用“服务”而可能获取的结果将是准确或可信赖的；及(iv)会员通过“服务”而购买或获取的任何产品、服务、资料或其他材料的质量将符合会员的预期。通过使用“服务”而下载或以其他形式获取任何材料是由会员自行全权决定进行的，且与此有关的风险由会员自行承担，对于因会员下载任何该等材料而发生的会员的电脑系统的任何损毁或任何数据损失，会员将自行承担责任。会员从系统或通过或从“服务”获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证责任。 
                </p>
                <p>
                    8.5如因不可抗力或其他系统无法控制的原因使系统系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，系统会合理地尽力协助处理善后事宜，但系统不对因此导致的任何损害赔偿（包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失）承担责任。前述情形包括但不限于：
                </p>
                <p>
                    (1)因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力因素，造成系统系统障碍不能执行业务的。
                </p>
                <p>
                    (2)系统系统停机维护的；
                </p>
                <p>
                    (3)电信设备出现故障不能进行数据传输的；
                </p>
                <p>
                    (4)由于黑客攻击、网络供应商技术调整或故障、网站升级、银行方面的问题等原因而造成的系统服务中断或延迟的。
                </p>
                <p>
                    <span>
                        <b>
                            第九条 隐私权保护及授权
                        </b>
                    </span>
                </p>
                <p>
                    9.1会员授权并同意系统可以根据会员在系统上的行为自动追踪相关会员的某些资料。在不违反法律法规和本协议的前提下，系统有权对整个会员数据库进行分析并对会员数据库进行商业上的合理利用，并可在系统的某些网页上使用诸如“Cookies”的资料收集装置。
                </p>
                <p>
                    9.2会员授权并同意系统可以使用会员的相关资料，包括但不限于系统持有的有关会员的档案中的资料，以及系统通过其他方式自行收集的资料，系统可通过人工或自动程序对会员资料进行评价，系统的合作伙伴为提供本协议项下服务可对会员信息和资料进行查询、收集或进行信息数据分析。为确保会员信息的安全，系统及其合作伙伴将对上述信息负有保密义务，并采取各种措施保证信息安全。
                </p>
                <p>
                    9.3系统采用法律规定和行业标准惯例对会员的信息保密，系统不会恶意出售或免费共享给任何第三方，但以下情况除外：
                </p>
                <p>
                    (1)向独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等提供会员信息；
                </p>
                <p>
                    (2)向具有合法调阅信息权限并从合法渠道调阅信息的司法部门或其他政府机构提供会员信息；
                </p>
                <p>
                    (3)向系统的关联实体提供会员信息；
                </p>
                <p>
                    (4)向经会员同意的第三方提供会员信息。
                </p>
                <p>
                    9.4经国家生效法律文书或行政处罚决定确认会员存在违法行为，或者系统有足够事实依据可以认定会员存在违法或违反本协议的行为，系统有权在系统上公布会员的违法、违约行为，并将有关行为记入与会员相关的信用资料和档案。
                </p>
                <p>
                    <span>
                        <b>
                            第十条 知识产权
                        </b>
                    </span>
                </p>
                <p>
                    10.1深圳市榕时代科技有限公司作为系统的运营商，拥有系统内容及资源的著作权等合法权利，受国家法律保护，有权对本协议、业务规则及系统的内容进行修改，并在发布之日起生效，无须另行通知会员。
                </p>
                <p>
                    10.2除法律另有强制性规定外，未经系统明确的特别书面许可,任何单位不得以任何方式非法全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，系统有权追究其法律责任。
                </p>
                <p>
                    10.3系统所刊登的资料信息（诸如文本、图表、标识、设计、源代码、图像、声音文件片段、数字下载、数据编辑和软件），均是系统或其内容提供者的财产，受中国和国际版权公约的保护。系统上所有内容的汇编是系统的排他财产，受中国和国际版权公约的保护。系统上所有软件都是系统或其关联公司或其软件供应商的财产，受中国和国际版权公约的保护。未经系统书面同意，不得将系统包含的资料等任何内容镜像到任何其他网站或者服务器。任何未经授权对系统内容的使用均属于违法行为，系统将追究其法律责任。
                </p>
                <p>
                    <span>
                        <b>
                            第十一条 通知
                        </b>
                    </span>
                </p>
                <p>
                    11.1会员应当准确填写并及时更新会员提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便系统或其他用户与会员进行有效联系，因通过这些联系方式无法与会员取得联系，导致会员在使用系统服务过程中产生任何损失或增加费用的，应由会员完全独自承担。会员了解并同意，会员有义务保持提供的联系方式的有效性，如有变更需要更新的，会员应按系统的要求进行操作。 
                </p>
                <p>
                    <span>
                        <b>
                            第十二条 赔偿
                        </b>
                    </span>
                </p>
                <p>
                    12.1会员同意，如因会员违反本协议或经在此提及而纳入本协议的其他文件，或因会员违反法律侵害了第三方的合法权利，或因会员违反法律须承担行政或刑事责任，而使第三方或行政、司法机关对系统及其子公司、关联公司、分公司、董事、职员、代理人提出索赔或处罚要求（包括司法费用和其他专业人士的费用），会员必须全额赔偿给系统及其子公司、关联公司、分公司、董事、职员、代理人，并使其等免遭损失。
                </p>
                <p>
                    <span>
                        <b>
                            第十三条 适用法律及争议解决
                        </b>
                    </span>
                </p>
                <p>
                    13.1本协议适用中华人民共和国大陆地区有效法律，如无相关法律规定，可参照商业惯例和（或）行业习惯。如发生本协议或系统的业务规则与中华人民共和国法律相抵触，则这些内容将完全按法律规定重新解释，而其他条款则依旧保持对会员的约束力。
                </p>
                <p>
                    13.2若会员和系统就本协议的订立和履行等事宜产生争议的，会员和系统应首先协商解决；协商不成，可向深圳市榕时代科技有限公司住所地人民法院起诉。
                </p>
                <p>
                    <span>
                        <b>
                            第十四条 其他
                        </b>
                    </span>
                </p>
                <p>
                    14.1本协议由本协议条款与系统的相关业务规则组成，本协议中未尽事宜应按照相关法律法规及系统的相关业务规则办理。
                </p>
                <p>
                    14.2会员与系统仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇佣与被雇佣或特性授权与被授权关系。
                </p>
                <p>
                    14.3会员同意系统因经营业务需要有权将本协议项下的权力义务就部分或全部进行转让，而无须再通知予会员并取得会员的同意。
                </p>
                <p>
                    14.4本协议取代会员和系统先前就相同事项订立的任何书面或口头协议。倘若本协议任何条款被裁定为无效或不可强制执行，该项条款应被撤销，而其余条款应予遵守和执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。系统未就会员或其他人士的某项违约行为采取行动，并不表明系统撤回就任何继后或类似的违约事件采取动的权利。
                </p>
                <p>
                    14.5本协议不涉及会员之间因网上交易而产生的法律关系及法律纠纷，系统不介入会员之间的交易纠纷，但可协助会员查明交易情况。
                </p>
                <p>
                    14.6会员同意全面接受和履行与系统其他会员在系统签订的任何电子法律文本，并承诺按该法律文本享有和/或放弃相应的权利、承担和/或豁免相应的义务。
                </p>
                <p>
                    14.7如非特别指明，本协议条款均适用于系统所有注册用户。
                </p>
                <p>
                    14.8深圳市榕时代科技有限公司作为系统的运营服务提供商，有权代表系统从事对外签署协议等相关民事行为，享有系统在本协议项下的权利并履行系统在本协议项下的义务。深圳市榕时代科技有限公司对本协议拥有最终的解释权。
                </p>
            </div>
             <div class="agreeBtn">
                <el-button @click="handleAgree">同意协议</el-button>
            </div>
        </el-dialog>
    </div>
</template>

<script>
    export default {
        props:["title"],
        data(){
            return {
                RegisterAgreementVisible:false,
            }
        },
        methods:{
            handleRegisterAgreementShow(){
                this.RegisterAgreementVisible = true
            },
            handleAgree(){
                this.$emit('agreement')
                this.RegisterAgreementVisible = false
            }
        }
    }
</script>

<style scoped>
.registeragreement /deep/ .el-dialog__body{
    padding: 10px 20px 30px;
}
.registeragreement /deep/ .el-dialog__header{
    text-align: center;
    background: #fff;
}
.registeragreement /deep/ .el-dialog__title{
    font-size: 18px;
    color:black;
}
.argeementContent{
    height: 500px;
    overflow: auto;
}
.agreeBtn{
    text-align: center;
    margin-top: 20px;
}
.el-button{
    width: 180px;
    height: 44px;
    background: #DB2B01;
    color: #fff;
    border: none;
    border-radius: 0;
}
.el-button:hover, .el-button:focus{
    background: #DB2B01;
    color: #fff;
    border: none;
}
</style>